app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `email` = 'mayuri.infospace@gmail.com'
 LIMIT 1
---
    function postCheck()
    {
        $validation = $this->validate([
            'email' => [
                'rules'  => 'required|valid_email|is_not_unique[users.email]',
                'errors' => [
                    'required' => 'Email is required.',
                    'valid_email' => 'Invalid email.',
                    'is_not_unique' => 'Email has already been taken.',
                ],
            ],
            'password' => [
                'rules'  => 'required|min_length[5]|max_length[20]',
                'errors' => [
                    'required' => 'Password is required.',
                    'min_length' => 'Password must have atleast 8 characters in length.',
                    'max_length' => 'Password must not have characters more thant 20 in length.',
                ],
            ],
        ]);

        if (!$validation) {
            return view('auth/login', ['validation' => $this->validator]);
        } else {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');
            $otp = $this->request->getPost('otp');
            $userModel = new Users();
            $user_info = $userModel->where('email', $email)->first();

SELECT *
FROM `users`
---
    function getUsers()
    {
        $usersModel = new \App\Models\Users;
        $query['users'] = $usersModel->findAll();