app/Controllers/Dashboard.php

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function getRegister()
    {
        $usersModel = new \App\Models\Users();
        $loggedUserId = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserId);

SELECT *
FROM `users`
WHERE `users`.`id` = '5'
---
    public function getAdminDashboard()
    {
        $usersModel = new \App\Models\Users();
        $loggedUserId = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserId);

SELECT *
FROM `users`
WHERE `users`.`id` = '11'
---
    public function getUserDashboard()
    {
        $usersModel = new \App\Models\Users();
        $loggedUserId = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserId);

SELECT *
FROM `users`
WHERE `users`.`id` = '10'
---
    public function getUserProfile()
    {
        $usersModel = new \App\Models\Users();
        $loggedUserId = session()->get('loggedUser');
        $userInfo = $usersModel->find($loggedUserId);